---
kind: method
id: M:Autodesk.Revit.DB.LineProperties.Dispose
source: html/33fa777f-455a-1aa9-b79f-3f8bd3a8e91d.htm
---
# Autodesk.Revit.DB.LineProperties.Dispose Method

Releases all resources used by the LineProperties

## Syntax (C#)
```csharp
public void Dispose()
```